app/controllers/comments_controller.rb

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2)

  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 7)
UPDATE `comments` SET `content` = 'El que estaba vacío', `updated_at` = '2009-08-10 21:42:35' WHERE `id` = 7