app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `comments` (`updated_at`, `post_id`, `author`, `content`, `author_email`, `created_at`) VALUES('2009-08-12 22:04:00', 2, 'Hugo Chávez', 'socialismo', 'hugo@chavez.com', '2009-08-12 22:04:00')
---
  def add_comment
		@comment = Comment.new(params[:comment])
		@post = Post.find(params[:id])
		@comment.post = @post

    if @comment.save

SELECT * FROM `posts`
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_type = 'Post') AND (`taggings`.taggable_id = 1) AND ((taggings.context = 'tags')))
---
  def index
    @comment = Comment.new
    if params[:tag]
      @posts = Post.tagged_with(params[:tag], :on => :tags)
    else
      @posts = Post.all

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @comment = Comment.new
    @post = Post.find(params[:id])

INSERT INTO `posts` (`updated_at`, `title`, `body`, `comments_count`, `created_at`) VALUES('2009-08-10 01:11:12', 'test02', 'content02', 0, '2009-08-10 01:11:12')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `body` = 'Keep It Simple 1.0 is a free, W3C-compliant, CSS-based website template by www.styleshout.com. This work is distributed under the Creative Commons Attribution 2.5 License, which means that you are free to use and modify it for any purpose. All I ask is that you include a link back to www.styleshout.com in your credits. For more free CSS designs, you can visit www.styleshout.com to see my other works.\r\nGood luck and I hope you find my free templates useful!', `updated_at` = '2009-08-11 21:06:07' WHERE `id` = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])